start_text = "Привет, {username}\n\nМеня зовут Никки, и в команде Skillbots я отвечаю за курсы по дизайну и креативу. " \
             "Прямо здесь и сейчас я могу научить тебя основам профессии дизайнера. Рука об руку мы освоим ту базу, " \
             "которая поможет тебе начать работать в качестве дизайнера уже после прохождения курса. \n\nНад курсом " \
             "работали настоящие гуру дизайна, а также писатели, редакторы и программисты. Ну и, конечно же, " \
             "я. Не терпится показать, что же у нас получилось! Я уверен, что тебе понравится. \n \nХочешь узнать про "\
             "структуру или сюжет курса? Или можем сразу начать?"

structure_course = "Курс состоит из 10 разделов:\n      1) Вводное занятие\n      2) Насмотренность и вдохновение\n      3) " \
         "Композиция\n         3.1. Модульные сетки\n         3.2. Правило якорные объектов\n         3.3. Правило " \
         "внутреннего и внешнего\n      4) Типографика\n      5) Работа с цветом\n      6) Возможности графической " \
         "программы Figma\n      7) UX/UI дизайн\n      8) Начало работы над задачей\n      9) Фотостоки и " \
         "иллюстрации\n      10) Где искать заказчиков"

plot_course = "Я считаю, что обучение должно быть веселым. Да, иногда меня так и называют Веселый Никки ))\n\nПоэтому " \
              "в курсах Skillbots есть игровой сюжет, в котором я помогаю вам двигаться вперед шаг за шагом, " \
              "преодолевая различные ситуации, учебные разделы и практические задачи.\n\nВы наконец решились начать " \
              "свое собственное дело. Ваш новый бизнес достался вам прямо от доброй феи, которая явилась однажды к " \
              "вам в офис со слезами на глазах. Она достала из сумки тыкву и сказала, что у нее есть бизнес-идея на " \
              "миллион, но никто ей не верит и не хочет покупать ее тыквы.\n\nТолько от вас зависит, сможете ли вы " \
              "преподнести тыквы в самом выигрышном свете так, чтобы, увидев их, потенциальный клиент сразу заказал " \
              "себе одну или две!  Только вы можете с помощью диджитал дизайна «упаковать» тыквы так, чтобы люди " \
              "заинтересовались ими.\n\nДерзайте, мир не может жить без магии! Выполняйте задания и помогайте своей " \
              "знакомой фее! Я думаю вам улыбнется удача!"

text_for_payment = "Теперь про оплату. Я был бы рад сделать сервис бесплатным, ведь тогда я бы смог обучить еще " \
                   "больше людей... Но над материалами работала команда экспертов, дизайнеров, редакторов и " \
                   "программистов. Каждый из них вложил в этот курс душу. \n\nКстати, сегодня действует скидка — " \
                   "70%.\n\nОплатить курс можно на этой странице:\nhttps://www.skillbots.ru/design\n\nПосле оплаты вы " \
                   "получите код активации — пришлите его сюда."

not_successful_payment = "Извините, но ваш код не подходит. Приобрести код активации [можно на нашем " \
                         "сайте](https://www.skillbots.ru/design?utm_source=error_code_tg&utm_medium=tgbot). " \
                         "Если у вас возникли сложности, то напишите на [@skillbots_support]" \
                         "(https://t.me/skillbots_support)"

text_after_pay = "Спасибо за оплату! \n\nНу что, начнем?"

text_for_reminder_1 = "Пришлите мне код активации, который можно получить здесь. После этого курс запустится.\n\nЕсли "\
                      "есть какие-нибудь вопросы, то напиши нам на [@skillbots_support](https://t.me/skillbots_support)"

text_for_reminder_2 = "Напоминаю, что сегодня действует скидка 70% — доступ к курсу можно получить всего за 2990 " \
                      "руб.\n\nУзнать подробнее про обучение можно на нашем " \
                      "сайте:\nhttps://www.skillbots.ru/design\n\nПосле оплаты вы получите код активации — пришлите " \
                      "его мне, чтобы запустить курс."

start_history_text = "Еще один день в офисе, похожий на все остальные. Вы снова опоздали на работу, и теперь " \
                     "стараетесь наверстать упущенное, чтобы хоть как-то оправдать себя. Вот уже скоро обед. И вдруг " \
                     "вас вызывают в холл к администратору: к вам посетитель. Кто бы это мог быть?"

text_scary = "Вы боитесь, что босс будет ругаться, ведь вы и так опоздали. Поэтому склонив голову над клавиатурой " \
             "продолжаете изображать активную деятельность. Но любопытство мучает вас. Ведь обычно к вам никто не " \
             "приходит на работу. \n\nАдминистратор настойчиво звонит вам снова. Вы смотрите на часы и понимаете, " \
             "что все равно уже время обеда."

wonder_who_text = "Вы спускаетесь в холл вашего офиса на первый этаж. Проходящий мимо босс бросает на вас " \
                  "уничижительный взгляд, и вы вздрагиваете и здороваетесь с ним во второй раз. Как же он вас достал! "\
                  "Однажды вы выскажете ему все, что накипело!"

text_1 = "Вы идете в холл и первое, что вы видите – это неземной красоты незнакомка. Она стоит спиной к окну, " \
         "поэтому лица не видно. Зато ее волосы ярко рыжего цвета буквально пылают в лучах солнца. Боже! Кто это? " \
         "Врядли это ко мне. \nВы рассеянно смотрите по сторонам. Администратор хмурится и кивает в сторону " \
         "незнакомки. В холл заходит посетитель и замирает. Несколько человек останавливается проходя по своим делам, " \
         "не в силах побороть восхищение незнакомкой в холле.\nВы понимаете, что единственный посетитель – это она."

landscape_text = "Вы начинаете спрашиваете у администратора, как у нее дела. Она багровеет и продолжает делать знаки, " \
                 "указывая на незнакомку. \nВы неловко откашливаетесь и задумчиво смотрите вдаль. Пытаясь понять " \
                 "реальный ли человек стоит за спиной или это голографическая технология. Уж очень завораживающее " \
                 "зрелище. Ваш коллега налетает на вас, засмотревшись на даму. Это приводит вас в чувства."

speak_first_text = "Вы откашлялись и двинулись в сторону девушки с рыжими волосами. Она тут же устремилась к вам на " \
                   "встречу. \n- Привет, {username}! Наконец-то мы встретились!"

who_you_text = "\nПростите, что свалилась как снег на голову. Позвольте представиться. Меня зовут Джессика, " \
               "я ваша фея-крестная👋\nМногочисленные дела в Европе никак не позволяли мне появиться в вашей судьбе " \
               "раньше. Но вот я здесь и у меня есть для вас сюрприз!"

surprise_text = "О! У меня есть гениальная бизнес-идея. Но если вы хотите что-то попроще? То вот, - с этими словами " \
                "она показала на вход. За стеклянными дверями стояла роскошная машина. Это Феррари новенькой модели, " \
                "которая по цвету была, как и волосы незнакомки – ярко оранжевой. А за рулем сидел ваш покорный " \
                "слуга, Никки. Это была наша первая встреча. \nА машина предназначалась в подарок. О чем говорил " \
                "красивый бант сбоку и надпись: «дорогому крестнику!»"

you_want_me_text = "Вы невольно ахнули. Но что-то здесь не так. Ведь бесплатный Феррари бывает… вообще такого не " \
                   "бывает. \n\nОна продолжала:\n- Видите ли, у меня свой сельскохозяйственный бизнес. Но последнее " \
                   "время дела идут из рук вон плохо. Я всю жизнь выращиваю тыквы. Раньше еще можно было как-то жить " \
                   "за счет этого. То джин обратиться ко мне – его клиент загадал машину. То колдунья придет за " \
                   "тыквой. А иногда и сам!.. люди готовы продать душу за кусок железа."

dont_understand = "Все просто! Мои тыквы волшебные. В полночь, если произнести заклинание, они превращаются в " \
                  "спорткар. Да, да, а раньше превращались в карету. \n\nДжессика поправила волосы. Она явно была " \
                  "довольна произведенным эффектом. Ведь у вас от удивления открылся рот. \n\n- Но вот беда, " \
                  "никто не хочет их покупать! Ума не приложу, что не так? Я думаю нужна современная реклама в " \
                  "интернете. На джинов и колдуний надежды уже совсем нет."

pumpkins_these = "С серьезным лицом девушка достала из сумки небольшую оранжевую тыкву. \nВ этот момент вы решили, " \
                 "что вас разыгрывают. И принялись осматриваться по сторонам. Но в холле никого не было. \n\nВы 5 " \
                 "минут тупо смотрите на тыкву перед вами. Обычная небольшая, довольно плотная. Наверное из таких " \
                 "тыкв получаются отличные украшения на хэлоуин, а может быть и неплохая тыквенная каша. Но Феррари! " \
                 "Вы снова смотрите на улицу. \n\nЯ поправляю бантик на спорткаре и приветливо машу вам через стекло " \
                 "деверей."

ordinary_pumpkin_text = "Именно так все и думают! И вместе мы должны это исправить 😊\n\nПроблема в том, что тыквы " \
                        "выглядят невзрачно. Волшебная тыква на вкус такая же как обычная. Но знали бы люди, " \
                        "как сложно вырастить одну такую тыкву! \n\nНам нужно сделать так, чтобы тыквы стали " \
                        "привлекать покупателей! Нужно продемонстрировать весь их потенциал! Ведь это же настоящее " \
                        "100% волшебство! Я и сертификат даю. Но что толку – на словах никто не верит. Нужно показать " \
                        "людям, иначе они не поверят. \n\nВы невольно бросаете взгляд на улицу. Феррари все еще там."

how_do_this_text = "Для этого я оставлю с вами Никкиа. Это робот-учитель. Он посвятит вас в тайны дизайнерской " \
                   "алхимии. После чего вы сможете овладеть тайным знанием и разработать макеты рекламы волшебных " \
                   "тыкв для интернета. \n\nПросто найдите лучший вариант для визуальной рекламы, чтобы мы могли " \
                   "начать покорять интернет. И я обещаю, что отдам вам весь бизнес целиком, за процент от продаж. " \
                   "Тогда я смогу полностью посвятить себя своему огороду и путешествиям. \n\nС этими словами дама " \
                   "мечтательно уставилась в потолок, вспоминая о далеких тыквенных полях Прованса. Потом она вдруг " \
                   "засмеялась, сделала шаг назад и растворилась в свете. \n\n- кто это? – голос администратора вывел " \
                   "вас из забытья. \n- Это моя дальняя родственница. \n\nВы вышли на улицу, пытаясь найти " \
                   "таинственную гостью, и тут же наткнулись на меня. \n\n- Скажите, вы готовы начать обучение? 💪"

chapter_1 = "***\nГЛАВА 1. ДИЗАЙН – ЭТО СОВРЕМЕННАЯ МАГИЯ\n***"

i_ready_text = "Тогда начнем ☺️\n\nЯ расскажу вам о возможностях " \
               "дизайна, с помощью которых вы можете быстро продавать хоть овощи, хоть автомобили. Дизайн – это " \
               "тайное оружие современных магов и маркетологов. Он позволяет наглядно доказать выгоды покупки, " \
               "убедить людей в пользе и необходимости товара. То, что не удается сделать страницам текстов и часам " \
               "уговоров, можно за секунды осуществить с помощью профессионального дизайна. Такова сила воздействия " \
               "этого орудия.  \nБез него нам не справиться."

car_text = "Вы получите ее сразу после прохождения обучения. \nЧто ж, это похоже на сон. Но робот стоит перед вами и " \
           "ждет вашего решения."

good_i_ready_text = "Нас окружает дизайн: баннеры на улицах, упаковка продукта в супермаркете, рекламный ролик на " \
                    "ютубе, захватывающий шутер или аркада на телефоне. Над все этим работают моушн-, саунд-, гейм-, " \
                    "продакт-, ландшафтные, промышленные, графические дизайнеры и иллюстраторы. Дизайнеры эмоции и " \
                    "идеи превращают в визуально-понятные для пользователя образы, при этом думаю не только об " \
                    "эстетике, но и о функциональности.\nМногие из сфер дизайна объединяет в себе графический дизайн."

graphic_design_text = "Графический дизайнер — универсальный специалист. Умеет работать как с печатной продукцией, " \
                      "так и в сфере digital.\nОн создает фирменный стиль и весь визуальный контент для брендов: " \
                      "баннеры и плакаты, упаковку, логотип и фирменный стиль, дизайн соцсетей и макеты сайта."

our_goal_text = "В курсе мы раскроем темы, которые можно применить как в онлайн, так и в офлайн-мире. Но акцент " \
                "все-таки сделаем на цифровой среде и более узкой профессии *диджитал-дизайнера.*"

link_photo_1 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/7464830f-70d8-48b8-9d10-0f7c0ff96724"

digital_design_text = "Еще используют другое название профессии — это UI/UX-дизайнер. UI — User Interface (" \
                      "пользовательский интерфейс), UX — User Experience ( пользовательский опыт)."

digital_design_2_text = "Звучит сложно? Ну ничего, дальше будет проще! \nА теперь самое интересно! Кому это все нужно?"

who_needs_all_this_text = "Диджитал-дизайнеры востребованы в крупных компаниях (на текущий момент больше 3000 " \
                          "вакансий на работных сайтах), в дизайн-агентствах и агентствах полного цикла. Зарплата " \
                          "начинающего специалиста от 60 000 рублей.\n\nМногие компании нанимают специалистов под " \
                          "конкретные проекты, не в штат, и готовы платить за это деньги, поэтому фриланс в " \
                          "диджитал-дизайне тоже распространен. Как правило, фрилансер работает удаленно и может " \
                          "зарабатывать до 200 000 рублей в месяц, если нашел заказчика (или заказчик нашел его)."

text_2 = "Неплохо, правда? И все это благодаря навыкам дизайна!"

text_3 = "*Необходимые навыки диджитал-дизайнера:*        \n— базовые знания в графический дизайне (композиция, типографика, цвет, креативное и системное мышление)       \n— понимание трендов визуального искусства, «насмотренность», стремление развиваться       \n— командная работа, понимание специфики каждого специалиста (в том числе разработки и маркетинга)     \n— управление временем     \n— умение защитить проект перед заказчику или менеджером внутри команды"

text_4 = "Вот их то мы и будем изучать, чтобы создать упаковку нашего тыквенного стартапа."

text_5 = "Хороший вопрос. Для работы нужно овладеть конкретными инструментами."

text_6 = "*Основные инструменты диджитал-дизайнера:*\n\nFigma – самая актуальный и востребованный онлайн-редактор. Можно пользоваться как в браузере, так и скачать приложение на компьютер с figma.com\n\nПакет Adobe (Photoshop, Illustrator, After Effects) – самые популярные программы для работы с растровой и векторной графикой, создания анимации. Пробную версию на 30 дней можно скачать с официального сайта creativecloud.com\n\nБлокнот, Miro, Гугл-документы, Keynote — дополнительные инструменты, которые могут создавать mindmap, создавать прототипы, презентовать свою работу заказчику."

text_7 = "Именно здесь творится вся магия. Но чтобы ее освоить, нужно для начала вооружиться знаниями. "

text_8 = "У меня на курсе и в книгах, конечно! "

text_9 = "Больше погрузиться в профессию поможет литература"

link_photo_2 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/496a35b6-4204-4d74-87e9-037c1d88424c"

link_photo_3 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/be550b7e-f53a-4b52-9cd2-847c8bd5d0f4"

link_photo_4 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/be550b7e-f53a-4b52-9cd2-847c8bd5d0f4"

text_10 = "В начале всегда сложно запомнить новое! Но, не беспокойтесь об этом, вы быстро всему научитесь. И сможете играючи рекламировать не только тыквы, но и все, что пожелаете. \nНо для этого важно, чтобы вы не только запоминали информацию, но и понимали, о чем я говорю. Поэтому, в конце каждого раздела я буду задавать вам некоторые вопросы для закрепления полученных знаний. \n\nВы готовы пройти небольшой тест? "

text_11 = "В чем отличия графического и диджитал-дизайнера\n\n1) Это разные название одного и того же, различий нет\n2) Графический дизайнер охватывает множество направлений в дизайне как цифровых, так и аналоговых носителей. Диджитал- дизайнер направлен только на проектирование в онлайн-пространстве\n3) Графический дизайнер работает с графикой — иллюстрации, постеры, рекламные баннеры и тд. Диджитал-дизайнер все это переводит в цифровой формат."

text_12 = "✅ Это правильный ответ \nНо следует уточнить, что у этих понятий много общего."

text_13 = "Диджитал дизайнер изначально ориентирован на цифровой дизайн и цифровые носители. "

text_14 = "Что такое UI и UX?\n\n1) UI и UX – дополнительная приставка в портфолио дизайнера, чтобы создать впечатление профессионализма\n2) UI — User Interface (пользовательский интерфейс), UX — User Experience ( пользовательский опыт).\n3) UI и UX — дизайнер, который занимается отрисовкой интерфейсов"

text_15 = "✅ Это правильный ответ. Ориентированность на пользователя играет важную роль в современном дизайне. "

text_16 = "Не верно. UI и UX – это целая система знаний, которые постоянно используются в работе. "

text_17 = "👍 Отлично. вы прошли тест и усвоили полученную информацию. Готовы перейти к следующей главе? "

text_18 = "*ГЛАВА 2. НАСМОТРЕННОСТЬ И ВДОХНОВЕНИЕ*"

text_19 = "Для того, чтобы сформировать вкус, накапливать базу дизайнерских решений и отслеживать тренды важно видеть много примеров работ. Это позволяет тренировать насмотренность — умение наблюдать, фиксировать плюсы и минусы в работах любых направлений и в окружающем мире."

text_20 = "Есть один простой совет. "

text_21 = "Сформируйте привычку — по утрам посещайте дизайнерские ресурсы, пополняйте свои коллекции и уже через несколько месяцев вы сформируете свое видение практически на любую дизайн-задачу."

text_22 = "*Ресурсы для вдохновения:*\n\nBehance.net – самый популярный дизайн-ресурсы, где профессионалы со всего мира формируют свои портфолио. Многие заказчики находят исполнителей именно здесь, просматривая работы, которые завоевали награды и находятся в подборках.\nТакже на этом сайте многие пользователи собирают коллекции и делятся ими с любым желающим, вот пример:\nhttps://www.behance.net/collection/17282653/UIUX \nhttps://www.behance.net/collection/72317/WEB-Design \nDribbble.com – здесь выкладываются «шоты» - небольшие зарисовки, концепты, иллюстрации и анимация. Подходит, когда надо быстро посмотреть возможные решения или вдохновиться необычными концептами.\nmadeontilda.ru - галерея отобранных экспертами Tilda лучших работ, которые собраны на конструкторы и являются примерами современного веб-дизайна. \npinterest.com – коллекция изображений из любой сферы по направлениям, которая пополняется любым пользователем сети. Можно создавать свои «доски» и добавлять любую из понравившихся работ."

text_23 = "А эта подборки лучших сайтов со всего мира, большинство из них взяли награды:\nsiteinspire.com \nland-book.com \nawwwards.com \n"

text_24 = "Но мало просто зайти на сайт, чтобы смотреть картинки. С ними нужно работать!"

text_25 = "Любую понравившуюся работу лучше проанализировать, задавая себе вопросы:\nЧто именно мне нравится?\nМожет быть какая-то конкретная деталь? или цвета, шрифты , композиция? \nЧто смущает и что можно бы было сделать лучше?\nЧто можно было бы поменять, чтобы работа стала нравится полностью\nКак дизайнер пришел к такому решению?\nКакую подготовительную работу провел дизайнер, чтобы получился именно этот вариант? Почему он выбрал именно такое расположение элементов, шрифт или слова? Какая может быть ЦА?\n\nНо это еще не все! Есть еще как минимум два инструмента, чтобы прокачаться с помощью чужих работ."

text_26 = "*Повторить за автором*\nДля того, чтобы перебороть страх «белого листа» можно начать с копирования лучших дизайнов: полностью перенести готовую работу в графический редактор, слой за слоем. Это поможет понять, чем руководствовался создатель при выборе решения, какими инструментами он пользовался."

text_27 = "*Референсы и мудборды*\nЭти инструменты помогают подступиться к любой из задач.\n\nРеференсы (от англ reference – рекомендация, справка) — это картинка для вдохновения, которая задает направление для будущего дизайна.\n\nМудборд (от англ. mood board — доска настроения) — это коллаж, собранный из фотографий, иллюстраций, текстур, иконок, цветовых схем и шрифтов, то есть из множества референсов.  Мудборд необходим для понимания будущего дизайн-проекта: каким он будет — веселым и игривым или серьезным и прагматичным, какие могут быть шрифты и сочетание цветов, какие визуальные образы подходят для задачи."

link_photo_5 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/93fbc057-e5af-4121-a660-2479f497e92f"

text_28 = "Ну что? Вдохновляет? Вижу, как у вас горят глаза и не терпится попробовать самому! \nИ пробуйте! А пока у меня есть еще кое-что интересное для вас! "

text_29 = "Почти. Это Дополнительные материалы по теме. Очень советую ознакомиться"

text_30 = "Youtube \nTilda Publishing Russia\nhttps://www.youtube.com/watch?v=aKuuXFYPYac"

link_photo_6 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/52a84b82-457c-4ac8-ab07-082dfc4b5a93"

text_31 = "Кради как художник. 10 уроков творческого самовыражения Остин Клеон"

text_32 = "Надеюсь здесь было все понятно? "

text_33 = "Отлично, тогда ответьте на несколько моих вопросов, чтобы закрепить материал."

text_34 = "Мини-тест"

text_35 = "Какая из работ размещена на dribbble.com?"

link_photo_7 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/6e8a04b6-7a33-4e69-b255-057a636336f9"

text_36 = "Что такое Мудборд?\n\n1) Коллаж, который используется для понимания развития будущего дизайн-проекта\n2) Доска визуализации для постановки целей дизайнера\n3) Дневник настроения дизайнера, где важно фиксировать все произошедшее при работе с заказчиком"

text_37 = "✅ Это правильный ответ. Вижу вы уже побывали на сайтах для дизайнеров! Так держать!"

text_38 = "Это неправильный ответ. Все-таки посмотрите сайты! Ведь вам нужно от чего-то отталкиваться! Насмотренность сама себя не насмотрит!"

text_39 = "✅ Это правильный ответ. Приступать к работе проще, когда есть конкретные образы, а не абстрактные идеи. "

text_40 = "Это неправильный ответ.  Хотя этот инструмент вы тоже можете использовать для работы. "

text_41 = "👍 Отлично. вы прошли тест и усвоили полученную информацию. Готовы двигаться дальше? "

text_42 = "*ГЛАВА 3. КОМПОЗИЦИЯ*"

text_43 = "Вот это да! Сколько интересного вы увидели, изучая ресурсы для дизайнеров. "

text_44 = "Страх в новом деле явление обычное. Но не нужно бояться. Все начинали с нуля, также как вы. Даже фея Джессика не сразу стала выращивать такие крутые тыквы. Сначала они не хотели превращаться в спорткары. Первые тыквы превращались в велосипеды и самокаты. Со временем она училась, становилась сильнее, - стали получаться мотоциклы и так с каждым разом все лучше и лучше. Теперь она мастерски выращивает волшебные тыквы.\nНо знаешь, однажды в начале у нее получились роликовые коньки. Она даже расплакалась от досады, но продолжила заниматься. И мы продолжим! Верно?"

text_45 = "Для того, чтобы отдельные элементы дизайна превратились в одно целое необходимо принимать во внимание их расположение в пространстве листа (или экрана, как в нашем случае). Важно, чтобы изображения, текст, графика и цвета формировались в единый дизайн, в котором все сочетается между собой."

text_46 = "Грамотное составление композиции позволяет не только привнести внешнюю красоту в работу, но также сделать функционально-важные акценты, выделить главное. Поэтому предлагаю пройтись по основным советам и техникам, которые помогут выполнить задачу композиционно верно."

text_47 = "*Правило третей*\n\nПомогает, когда надо быстро разметить расположение основных элементов на страницедолжно :\nразделите ее на девять равных частей — самое важное должно находиться на пересечении линий. "

link_photo_8 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/4adf91ac-df9a-4c9c-84e6-ccab4000e6f3"

link_photo_9 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/4eb5cf93-65f3-4717-bcce-941e1000a6b9"

link_photo_10 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/1dcac9d5-5661-4e01-a4ae-42f6d07ae1e0"

link_photo_11 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/cf64ab92-3753-4837-a345-d777ee094211"

link_photo_12 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/c1af7cf8-cef3-4fad-9af5-e81f06dd0f12"

text_48 = "*Управление взглядом читателя*\n\nНаправляйте взгляд зрителей с помощью линий, стрелочек, различных фигур и изображений человека. Так вы сможете добиться правильного восприятия вашего дизайна."

text_49 = "*Иерархия и масштаб*\n\nИерархия — структурирование элементов в порядке важности. Сделайте акцентный элемент крупнее и ярче, а дополнительные — меньше. Создавайте контраст между элементами для привлечения внимания к крупной или наоборот, мелкой детали."

text_50 = "*Использование белого пространства*\n\n«Воздух» позволяет добиться баланса между изображением, текстом, текстурой и деталями. Благодаря большому количеству белого пространства каждый элемент имеет собственную территорию и может «дышать», что позволяет дизайну выглядеть опрятно."

text_51 = "*Ритм*\n\nИспользование ритмичного расположения элементов позволяет выделить необходимый объект с помощью отклонения от ритма. \nТакже ритмичность используется для «дорисовывания» мозгом следующих элементов дизайна и придания изображению смысла."

text_52 = "Важное замечание для диджитал дизайна!"

link_photo_13 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/8d757587-8d7c-45d2-b295-55f1878a0f79"

text_53 = "Идем дальше! Рекомендации конечно помогут. Но \nПомимо этих рекомендаций есть базовые правила в композиции."

text_54 = "*3.1. Использование модульных сеток*"

text_55 = "Вот здесь уже начинается настоящая магия дизайна! \nМодульная сетка — это система отступов и расстояний, которые делят страницу на модули. "

text_56 = "Сетка привносит порядок и делает восприятие макета целостным:\n• помогает найти место для любого элемента и определить расстояние между ними\n• помогает быстро сделать адаптивный дизайн для множества форматов (планшетов и мобильных устройств)\n• помогает добиться чистоты и гармоничности в дизайне"

link_photo_14 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/f8551312-0958-40dc-81b8-9851f324a5bf"

text_57 = "Как построить сетку для веб-страницы?\n\n1. Определяем число колонок\n12 — оптимальное число колонок. Помогает размещать как четное, так и нечетное число элементов на странице (например, 3 или 4)\n\n2. Определяем расстояние между колонками и отступ от края экрана.\nМежколоночное расстояние считаем исходя из получившегося размера одной колонки, кратное 10px (20, 30, 40). Отступы от края экрана делаем исходя из ширины контентной части, например, 1200-1400 px\n\nНу что? Пока понятно, как работает сетка?  "

link_photo_15 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/e4091bfe-f448-4f48-801b-1ade1e0909da"

text_58 = "Модульные сетки помогают работать с адаптивом дизайна для мобильных устройств. Так, элементы в сетке в 12 колонок отлично перестраивается в 8 и 4 колоночную сетку."

text_59 = "Упрощают работу специальные сервисы, которые мы найдем в интернете. Так что рисовать по клеточкам не нужно. \nИнструменты, которые помогут рассчитать сетку:\n\nhttp://gridcalculator.dk/\nСервис, который позволяет рассчитать сетку с заданными параметрами и скачать файл для Photoshop, Illustrator или просто изображение в формате png.\n\nhttp://modulargrid.org/#app\nПриложение, которое считает все параметры сетки. Можно установить на компьютер, либо сохранить паттерн для Photoshop.\n\nhttps://960.gs/ \nГотовая бесплатная сетка под разрешение 960 px для различных редакторов Fireworks, Flash, InDesign, Illustrator, Photoshop, QuarkXPress и т.д."

text_60 = "До тыкв мы еще дойдем. Ведь сайт с тыквами нам обязательно понадобится. \nА пока, советую почитать книги по теме"

link_photo_16 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/444eab09-9e71-41c1-8f95-d7168a7793aa"

text_61 = "Йозеф Мюллер-Брокманн\nМодульные системы в графическом дизайне"

link_photo_17 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/dbce7714-0124-4a16-b410-3e80efdc2d4a"

text_62 = "Итан Маркотт\nОтзывчивый веб-дизайн"

link_photo_18 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/bb163b1c-a1c7-4a1c-82dc-6f8fb414d659"

text_63 = "Кимберли Элам\nГрафический дизайн. Принцип сетки"

text_64 = "Идем дальше?"

text_65 = "*3.2. Правило якорных объектов*"

text_66 = "Якорные объекты, или «якори» — это самые заметные объекты на странице или экране: фигуры, иллюстрации, заголовки, логотипы и иконки. Простой абзац текста тоже выступает якорным объектом, если он вокруг него есть пространство.\nПравило говорит о том, что любой «якорь» должен тяготеть или располагаться в одном из углов или в центре своего прямоугольника."

text_67 = "Для акцента на этих «якорях» им надо оставлять достаточно свободного пространства вокруг. \n\nОбратите внимание, что речь скорее не о геометрическом, а визуальном центре (который в большинстве случаев чуть выше)"

link_photo_19 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/8bdec437-e2b3-47c3-a5d6-0582dd87bcd3"

text_68 = "Почему бы и нет! Ну или Спорткар. \n\nЯкорные объекты можно также разместить вдоль одной из силовых линий композиции:"

link_photo_20 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/5ec5a3dc-8b07-4ac3-b2ee-4d0164d288e5"

text_69 = "Центральные силовые линии и силовые линии по сторонам"

link_photo_21 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/18f8cfd4-7566-4136-9e51-7a28642fb8f7"

text_70 = "Вот еще немного полезной информации для погружения в тему. \nhttps://bureau.ru/soviet/20140324/\n(советы Бюро Горбунова)"

text_72 = "Прекрасно. И еще одно правило, о котором мы обязательно должны знать: "

text_73 = "*3.3. Правило внутреннего и внешнего (теория близости)*"

text_74 = "Правило звучит очень просто: объекты, расположенные рядом, кажутся связанными. Еще одна интерпретация этого правила: внутреннее расстояние внутри элементами одного блока должно быть меньше внешнего расстояния между смысловыми блоками:\n\n*внутреннее ≤ внешнее*"

text_75 = "Особенно легко нарушение этого правила можно увидеть при работе с текстом. Строки — это тоже объекты. Параграф — это группа объектов строк. Строка — это группа объектов слов, а слово — группа букв. Поэтому элементы текста нужно компоновать так, чтобы пользователь на затруднялся распознавать группы. "

link_photo_22 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/77fa6e2c-e70f-4ef8-859a-4e18808a970c"

text_76 = "В первом примере легко понять где заголовок первого уровня, а где второго. Во втором это не так очевидно, но мы можем понять по логике текста. В третьем примере то, что должно быть заголовком второго уровня, прибито к предыдущему параграфу\nи структура непонятна.\nПоэтому группировать объекты надо согласно правилу внутреннего и внешнего.\nЭто базовое правило графического дизайна. Поэтому оно применимо ко всему. "

link_photo_23 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/4aba44ac-ebdf-4eae-908e-e84cbe2efcbe"

text_77 = "Идем дальше?"

text_78 = "Отлично, тогда для закрепления материала, советую ознакомиться со статьями: \nhttps://bureau.ru/bb/soviet/20160503/\nhttps://www.artlebedev.ru/kovodstvo/sections/136/"

text_79 = "На какой из картинок элементы размещены согласно правилу внутреннего и внешнего:"

link_photo_24 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/65324940-2777-4f36-91df-21bf87b619b7"

text_80 = "✅ Это правильный ответ. Здесь внутреннее и внешнее хорошо читается и выглядит гармонично!"

text_81 = "Это неправильный ответ. Подзаголовок не отвечает правилу и расположен неправильно.  "

link_photo_25 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/132c96f0-c81e-4e55-8bb4-0509bf693b80"

text_82 = "На каком из изображений нагляднее показано правило якорных объектов"

text_83 = "✅ Это правильный ответ.  Силовые линии отчетливо прослеживаются, правило работает, захватывая внимание и направляя его. "

text_84 = "Это неправильный ответ.  Хаос и неразбериха вследствие игнорирования правила мешают быстро и цельно воспринять информацию! "

text_85 = "👍 Отлично. вы прошли тест, а это значит, что вы разобрались в главе о композиции.  Готовы двигаться дальше? "

text_86 = "*Глава 4. Типографика*"

text_87 = "Неожиданно в углу комнаты вы замечаете слабое свечение. "

text_88 = "Но тут из-за тыквы появляется Никки.\n- Ну что, не будем медлить! Еще немного и нужно будет собирать урожай.\nЧтобы тыква превратилась в спорткар, Джессика пишет на ней заклинание своей волшебной кисточкой. Она знает, как и что нужно написать. А без этого ничего не выйдет.\nВ дизайне тоже есть правила написания заклинаний и прочего контента. Текст будет работать только если он правильно оформлен. Эти правила мы и будем изучать."

text_89 = "*Текст — самый используемый объект в веб-дизайне. Поэтому надо уделить особое внимание работе со шрифтами: расположение текстовых объектов, сочетания шрифтов и их типы.*"

text_90 = "Ничуть! Здесь нужно просто запоминать."

text_91 = "*Типы шрифтов*"

text_92 = "Антиква — как правило, шрифт с засечками (serif)\nГротеск (приставка sans) — шрифт без засечек"

text_93 = "*старый стиль*"

text_94 = "Шрифты с засечками (Serif)"

link_photo_26 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/85bc3595-e35c-4f71-9b10-b6e988b9f570"

link_photo_27 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/660e05c6-c3c1-472b-9015-3a5754c20eac"

text_95 = "*современный стиль*"

link_photo_28 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/fd51ea57-e0c2-4db0-8285-2371b37e7228"

link_photo_29 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/1535c8f2-15dd-4f00-bcb9-60f240a25f4c"

text_96 = "Рубленые шрифты (удобны для чтения — sans serif )"

link_photo_30 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/9d89d419-c9b6-4ee2-8ecd-cd5353b83473"

link_photo_31 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/d3209a40-796c-42c2-8a9f-9004ad8a79ff"

link_photo_32 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/edba4a78-6864-4f5b-b7f8-55ed6c0dd3db"

link_photo_33 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/25d252e2-b0b1-4ead-99db-c09c932a69a7"

text_97 = "Декоративные шрифты (используется для акцента, например, на заголовках)"

text_98 = "Погнали!"

link_photo_34 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/7d43a302-80b3-4d80-bca4-72942ce903e3"

text_99 = "*Шрифтовые пары*"

text_100 = "Как правило, достаточно одного шрифта. Но для большего контраста используются шрифтовые пары. Самые удачные сочетания — шрифт без засечек и шрифт с засечками."

link_photo_35 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/4440ff74-e2b9-45ab-b72f-814da15dc62c"

text_101 = "Пара из разных гарнитуры из одного семейства. PT sans и PT serif"

text_102 = "Традиционное сочетание — шрифт без засечек для заголовков и с засечками для текста.Proxima Nova и PT Serif"

link_photo_36 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/b7780f09-ffa8-45c0-b62a-c54c843019d1"

text_103 = "Шрифт с засечками для заголовков.\nGeorgia и Roboto"

text_104 = "Есть сайты, на которых можно скомбинировать различные шрифты и посмотреть, как они будут сочетаться в проекте:\nhttp://font-combinator.com/\nhttps://www.paratype.ru/fontorium/typoscope/ "

text_105 = "Идем дальше. Давайте погрузимся в тайные знания и терминологию, чтобы стать настоящим заклинателем шрифтов!"

link_photo_37 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/43bb1a23-ba9f-42b9-a3dc-20b92274323f"

text_106 = "Рекомендуемый размер шрифта для комфортного чтения с экрана устройств — 16 px, \nМежстрочный интервал (интерлиньяж), комфортный для чтения (чтобы строчки не сливались)—24px"

text_107 = "Существует понятие — «отрицательный интерлиньяж». Это значит, что расстояние между строчками в тексте меньше, чем высота букв. Используется в тексте крупного размера, например, в заголовках."

text_108 = "Тяжело в учении – легко за рулем Феррари! \nНе будем останавливаться! Впереди самое интересное! Тире! С ним много путаницы. \nИ еще определения:"

link_photo_38 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/1bc4c3e4-4745-4ef5-b6ac-341e783664b6"

text_109 = "Строка не должна начинаться с дефиса или тире (исключение — прямая речь), поэтому эти знаки всегда завершают строчку."

text_110 = "Идем дальше!\nВыключка — ориентирование текста внутри блока:"

link_photo_39 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/5daffaf3-03d0-4b96-9b88-65930ca016bd"

text_111 = "Основные типы: полная выключка (justify), выключка по центру (align center), флаговая выключка (align left, align right)."

text_112 = "Для основного текста рекомендуется спользовать только выключку влево,для подписей — можно по центру."

text_113 = "Еще немного понятий из волшебного мира верстки. "

text_114 = "Неразрывный пробел — символ, который соединяет соседние слова и не дает им оказаться на разных строках. \n\nМягкий перенос — используйте его, чтобы перенести слово, перед которым он стоит, на следующую строку.\n\nВ вебе это специальные невидимые символы в языке HTML, которые ставятся между символами текста и либо связывают их, либо указывают место внутри слова,\nпо которому это слово может быть перенесено на другую строку:\n&shy; — мягкий перенос \n&nbsp; — неразрывный пробел"

text_115 = "А чтобы упростить работу с текстом, удобно использовать\nСервис, который поможет расставить символы для правильной верстки:\nhttps://www.artlebedev.ru/typograf/ \n\nИ еще вам пригодится \nВеб-сервис проверки правописания: https://orfogrammka.ru/ "

text_116 = "Отлично. А теперь самое главное. Это тоже нужно запомнить! \n\nБазовые правила типографики:\nСтараться  использовать не больше 2х шрифтов в одной работе:\nАкцентный — для заголовков\nОсновной — для остального текста (использовать безопасные, кросплатформенные шрифты)"

link_photo_40 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/626e3473-78a7-4a63-85f9-a0137e294c37"

text_117 = " •  Не злоупотреблять ПРОПИСНЫМИ БУКВАМИ\n •  Текст прописными буквами, набранный с разрядкой, читается легче (трекинг)"

text_118 = " •  Ссылки оформлять так, чтобы было понятно, что это ссылка\n •  Использовать только кавычки «ёлочки» \n •  Не допускать висячих предлогов"

text_119 = "Это основная информация по шрифтам и верстке. А чтобы узнать больше, я рекомендую следующие книги: \n\nДополнительная литература:"

text__1 = "А.Королькова\nЖивая типографика"

link_photo_41 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/cb92a0c4-7e66-4799-90ab-ef555376da65"

text__2 = "Э.Шпикерман\nО шрифте"

link_photo_42 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/db559dba-a472-46c0-b659-87f7af8ae887"

text__3 = "А.Горбунов\nТипографика и верстка\n\nhttps://bureau.ru/projects/book-typography/"

text__4 = "Что ж, сегодня мы узнали довольно много нового. И теперь пришла пора пройти мини-тест, чтобы освежить знания. "

text__5 = "Немного по настроению шрифта. Как думаешь, какой шрифт лучше подходит для оператора мобильной связи для бизнеса?"

link_photo_43 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/8a27e5ef-7bf4-4f45-85e4-5758902e96d2"

text__6 = "✅ Это правильный ответ.  Шрифт без засечек легко читается, выглядит современно и презентабельно. "

text__7 = "Это неправильный ответ. Стилизованные шрифты носят совершенно неподходящий характер, разрушая целостность послания и препятствуя восприятию главного посыла. "

text__8 = "Что такое интерлиньяж?\n1) Просвет между строками или расстояние от базовой линии до верхней точки строчных букв на следующей строке.\n2)  Название одной из начинок для шоколадных конфет\n3) Расстояние между базовыми линиями соседних строк в тексте"

text__9 = "✅ Это правильный ответ.  Речь идет о базовых линиях строк. "

text__10 = "Это неправильный ответ. И конечно, речь не о конфетах. "

text__11 = "👍 Отлично. вы прошли тест! Это значит, что вы разобрались в тех основах, которые помогут вам уверенно работать с шрифтами. Дальше вас ждет еще больше интересного.  Готовы? "

text__12 = "*Глава 5. Работа с цветом*"

text__13 = "Цвета — необходимая часть любого дизайна. Поэтому выбор и использование цветов для достижения целей может оказаться непростой задачей для дизайнера."

text__14 = "Сначала познакомимся с цветами: какие они бывают, как сочетаются. "

link_photo_44 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/f063b881-c1bf-4b6d-92a7-31d7c09f03ff"

text__15 = "Вот такие сочетания. Есть из чего выбрать. А дальше, идут собственно работа с цветами. Чтобы компьютер понял, какой цвет нам нужен, его необходимо задать. "

text__16 = "Цвета в вебе обозначаются в системе HEX, вида #000000 – это черный цвет, а #ffffff - это белый. Комбинация из букв и цифр между ними — все остальные веб-цвета. Также используется система RGB, где каждая цифра отвечает за кол-во определенного цвета красного (red), зеленого (green) и синего (blue). Например, RGB (255, 255, 255) — это белый цвета, а RGB (0, 0, 0) – черный."

text__17 = "Запоминать все обозначения цветов не нужно. Но важно знать, как правильно их сочетать и использовать в проекте. Поэтомупереходим к правилам."

text__18 = "*Правило 60-30-10*\n60% — пространства предназначено для основного цвета или цвета области;30% — это поддерживающий цвет; 10% — акцент и сопровождающий цвет."

text__19 = "Считается, что соблюдение этого правила позволит соблюсти баланс и сделает дизайн приятным глазу — композиция не будет разваливаться, а необходимые элементы выделены акцентным цветом (которого всего 10%)."

text__20 = "https://vc.ru/design/199498-kak-sozdat-kachestvennuyu-cvetovuyu-palitru-dlya-ui"

text__21 = "*Используйте палитры*\nДля удобства работы с цветам,создавайте палитры — это набор подходящих друг другу цветов, которые можно использовать в дизайне. Как правило, в палитре содержится 5-6 цветов (которые используются не только для основного дизайна, но для, например, теней или выделения объектов)."

text__22 = "Готовая палитра значительно облегчит работу. \n\nТакие палитры можно сделать на основе любой фотографии, или взять готовую палитру из брендбука заказчика (если есть такое требование) или воспользоваться сайтами, которые помогают подобрать нужное сочетание."

text__23 = "Используйте следующие сервисы:"

text__24 = "*Сервисы для составления палитр*"

text__25 = "https://www.flatuicolorpicker.com/\nhttps://www.materialpalette.com/\nhttps://coolors.co/\n\nРасширение для браузера для определения цвета: http://www.colorzilla.com/ "

text__26 = "*Не бойтесь черно-белого и монохрома*"

text__27 = "Один из трендов современного дизайна — использование черно-белых палитр или монохромного цвета. Не бойтесь экспериментируйте с такими цветами, ретушируйте фото, добавляйте подложки — все это поможет привести элементы дизайна к одной стилистике."

link_photo_45 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/52a2ac28-3687-470e-a4bc-460465539951"

link_photo_46 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/3badad00-4901-4a2c-a9c7-db8336626403"

text__28 = "*Принимайте во внимание психологию цвета*"

text__29 = "По законам психологии цвета, дизайнеры могут подобрать такие цвета, которые точнее передадут основной посыл своей работы. Ниже вы увидите универсальные ассоциации, связанные с базовыми цветами:"

text__30 = "*ЖЕЛТЫЙ*\nАссоциируется со счастьем, надежностью и уверенностью в себе. Дизайны, в которых желтый цвет основной, транслируют энергию и оптимизм."

link_photo_47 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/0c8e2452-7706-46ec-bbf5-9ff337d14f7c"

text__31 = "*СИНИЙ*\nСпокойствие, умиротворение и надежность. Страховые службы, банки и IT-компании часто выбирают этот цвет для своих логотипов и сайтов, потому что он транслирует безопасность и честность."

link_photo_48 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/6164249d-0d71-46ec-93e7-a5a1bad6c428"

text__32 = "*КРАСНЫЙ*\nКрасный привлекает внимание и ассоциируется с любовью, энергией, войной, силой и страстью."

link_photo_49 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/23d2cb33-3c71-4c30-b4ba-3d9a84873f74"

text__33 = "Что скажешь?"

text__34 = "Да, мир цвета удивителен. Узнать о нем больше можно по ссылке. \nhttps://skvot.io/ru/blog/glavnoe-o-tsvetovykh-skhemakh"

text__35 = "Для вдохновения:\n\nПодборка градиентов\nhttps://www.grabient.com/\n\nГотовые палитры цветов\nhttps://colorhunt.co/\n\nГенератор случайного цвета и градиента\nhttps://colorspark.app/ "

link_photo_50 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/c62060e6-b421-4c00-8588-bcc32401af6f"

text__36 = "Готов(а)?"

text__37 = "Отлично. Мы узнали очень много из мира цветов. Эта информация – настоящий клад. Мини-тест покажет, как хорошо вы ознакомились с этой главой. "

text__38 = "Выбери дизайн, который по ощущениям больше всего по цвету подходит для сайта креативного агентства?"

link_photo_51 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/9459a582-39ae-4265-84b5-d9f9257e917d"

text__39 = "✅ Это правильный ответ. Лаконичное цветовое решение вызывает доверие и говорит о серьезности агентства. "

text__40 = "Это неправильный ответ. Откровенная феминность и утрированный креативный стиль создают впечатление несерьезности."

text__41 = "Что такое HEX и RGB?\n\n1) Это сервисы для подбора цветовых палитр в веб-дизайне.\n2) Это цветовое коды, которые используются в веб дизайне.\nRGB – Red Green Blue\n3) Это теги в html, которые позволяют выбирать цвет нужного элемента в дизайне"

text__42 = "✅ Это правильный ответ. Лаконичное цветовое решение вызывает доверие и говорит о серьезности агентства. "

text__43 = "Это неправильный ответ. Откровенная феминность и утрированный креативный стиль создают впечатление несерьезности. "

text__44 = "👍 Отлично. Тест пройден. С цветами разобрались. Идем дальше! "

text__45 = "*Глава 6. Возможности Figma*"

text__46 = "А теперь перейдем к самому главному инструменту, который поможет нам непосредственно создавать диджитал дизайн для рекламы наших тыкв. Это почти что волшебная палочка, которая в руках дизайнеров способна на многое! "

text__47 = "Figma – на текущий момент самый популярный и удобный графический онлайн-редактор, в котором можно выполнить любую задачу диджитал-дизайнера. "
#
text__048 = "Почему Figma?\n    ●    интуитивно-понятный интерфейс\n    ●    возможность работы через браузер, достаточно только подключение к интернету (но есть и приложение, в которой можно работать и без сети)\n    ●    совместная работа над проектов - файлы хранятся в облаке и доступны для просмотра или редактирования всем, кому предоставят доступ"
#
text__049 = "Начало работы\nДостаточно зарегистрироваться на сайте figma.com. После регистрации можно сразу приступать к работе в окне браузера."
#
link_photo_052 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/a7ecf552-17f4-4600-a8f4-919b22f70b63"
# text__ = ""
#
# text__ = ""
#
# text__ = ""
#
# text__ = ""
#
# text__ = ""
#
# text__ = ""
#
# text__ = ""
#
# text__ = ""
#
# text__ = ""
#
# text__ = ""
#
# text__ = ""
#
# text__ = ""
#
# text__ = ""
#
# text__ = ""
#
# text__ = ""
#
# text__ = ""
#
# text__ = ""
#
# text__ = ""
#
# text__ = ""
#
# text__ = ""
#
# text__ = ""
#
# text__ = ""
#
# text__ = ""
#
# text__ = ""
#
# text__ = ""
#
# text__ = ""
#
# text__ = ""
#
