start_text = "Привет, {username}\n\nМеня зовут Никки, и в команде Skillbots я отвечаю за курсы по дизайну и креативу. " \
             "Прямо здесь и сейчас я могу научить тебя основам профессии дизайнера. Рука об руку мы освоим ту базу, " \
             "которая поможет тебе начать работать в качестве дизайнера уже после прохождения курса. \n\nНад курсом " \
             "работали настоящие гуру дизайна, а также писатели, редакторы и программисты. Ну и, конечно же, " \
             "я. Не терпится показать, что же у нас получилось! Я уверен, что тебе понравится. \n \nХочешь узнать про "\
             "структуру или сюжет курса? Или можем сразу начать?"

structure_course = "Курс состоит из 10 разделов:\n      1) Вводное занятие\n      2) Насмотренность и вдохновение\n      3) " \
         "Композиция\n         3.1. Модульные сетки\n         3.2. Правило якорные объектов\n         3.3. Правило " \
         "внутреннего и внешнего\n      4) Типографика\n      5) Работа с цветом\n      6) Возможности графической " \
         "программы Figma\n      7) UX/UI дизайн\n      8) Начало работы над задачей\n      9) Фотостоки и " \
         "иллюстрации\n      10) Где искать заказчиков"

plot_course = "Я считаю, что обучение должно быть веселым. Да, иногда меня так и называют Веселый Никки ))\n\nПоэтому " \
              "в курсах Skillbots есть игровой сюжет, в котором я помогаю вам двигаться вперед шаг за шагом, " \
              "преодолевая различные ситуации, учебные разделы и практические задачи.\n\nВы наконец решились начать " \
              "свое собственное дело. Ваш новый бизнес достался вам прямо от доброй феи, которая явилась однажды к " \
              "вам в офис со слезами на глазах. Она достала из сумки тыкву и сказала, что у нее есть бизнес-идея на " \
              "миллион, но никто ей не верит и не хочет покупать ее тыквы.\n\nТолько от вас зависит, сможете ли вы " \
              "преподнести тыквы в самом выигрышном свете так, чтобы, увидев их, потенциальный клиент сразу заказал " \
              "себе одну или две!  Только вы можете с помощью диджитал дизайна «упаковать» тыквы так, чтобы люди " \
              "заинтересовались ими.\n\nДерзайте, мир не может жить без магии! Выполняйте задания и помогайте своей " \
              "знакомой фее! Я думаю вам улыбнется удача!"

text_for_payment = "Теперь про оплату. Я был бы рад сделать сервис бесплатным, ведь тогда я бы смог обучить еще " \
                   "больше людей... Но над материалами работала команда экспертов, дизайнеров, редакторов и " \
                   "программистов. Каждый из них вложил в этот курс душу. \n\nКстати, сегодня действует скидка — " \
                   "70%.\n\nОплатить курс можно на этой странице:\nhttps://www.skillbots.ru/design\n\nПосле оплаты вы " \
                   "получите код активации — пришлите его сюда."

not_successful_payment = "Извините, но ваш код не подходит. Приобрести код активации [можно на нашем " \
                         "сайте](https://www.skillbots.ru/design?utm_source=error_code_tg&utm_medium=tgbot). " \
                         "Если у вас возникли сложности, то напишите на [@skillbots_support]" \
                         "(https://t.me/skillbots_support)"

text_after_pay = "Спасибо за оплату! \n\nНу что, начнем?"

text_for_reminder_1 = "Пришлите мне код активации, который можно получить здесь. После этого курс запустится.\n\nЕсли "\
                      "есть какие-нибудь вопросы, то напиши нам на [@skillbots_support](https://t.me/skillbots_support)"

text_for_reminder_2 = "Напоминаю, что сегодня действует скидка 70% — доступ к курсу можно получить всего за 2990 " \
                      "руб.\n\nУзнать подробнее про обучение можно на нашем " \
                      "сайте:\nhttps://www.skillbots.ru/design\n\nПосле оплаты вы получите код активации — пришлите " \
                      "его мне, чтобы запустить курс."

start_history_text = "Еще один день в офисе, похожий на все остальные. Вы снова опоздали на работу, и теперь " \
                     "стараетесь наверстать упущенное, чтобы хоть как-то оправдать себя. Вот уже скоро обед. И вдруг " \
                     "вас вызывают в холл к администратору: к вам посетитель. Кто бы это мог быть?"

text_scary = "Вы боитесь, что босс будет ругаться, ведь вы и так опоздали. Поэтому склонив голову над клавиатурой " \
             "продолжаете изображать активную деятельность. Но любопытство мучает вас. Ведь обычно к вам никто не " \
             "приходит на работу. \n\nАдминистратор настойчиво звонит вам снова. Вы смотрите на часы и понимаете, " \
             "что все равно уже время обеда."

wonder_who_text = "Вы спускаетесь в холл вашего офиса на первый этаж. Проходящий мимо босс бросает на вас " \
                  "уничижительный взгляд, и вы вздрагиваете и здороваетесь с ним во второй раз. Как же он вас достал! "\
                  "Однажды вы выскажете ему все, что накипело!"

text_1 = "Вы идете в холл и первое, что вы видите – это неземной красоты незнакомка. Она стоит спиной к окну, " \
         "поэтому лица не видно. Зато ее волосы ярко рыжего цвета буквально пылают в лучах солнца. Боже! Кто это? " \
         "Врядли это ко мне. \nВы рассеянно смотрите по сторонам. Администратор хмурится и кивает в сторону " \
         "незнакомки. В холл заходит посетитель и замирает. Несколько человек останавливается проходя по своим делам, " \
         "не в силах побороть восхищение незнакомкой в холле.\nВы понимаете, что единственный посетитель – это она."

landscape_text = "Вы начинаете спрашиваете у администратора, как у нее дела. Она багровеет и продолжает делать знаки, " \
                 "указывая на незнакомку. \nВы неловко откашливаетесь и задумчиво смотрите вдаль. Пытаясь понять " \
                 "реальный ли человек стоит за спиной или это голографическая технология. Уж очень завораживающее " \
                 "зрелище. Ваш коллега налетает на вас, засмотревшись на даму. Это приводит вас в чувства."

speak_first_text = "Вы откашлялись и двинулись в сторону девушки с рыжими волосами. Она тут же устремилась к вам на " \
                   "встречу. \n- Привет, {username}! Наконец-то мы встретились!"

who_you_text = "\nПростите, что свалилась как снег на голову. Позвольте представиться. Меня зовут Джессика, " \
               "я ваша фея-крестная👋\nМногочисленные дела в Европе никак не позволяли мне появиться в вашей судьбе " \
               "раньше. Но вот я здесь и у меня есть для вас сюрприз!"

surprise_text = "О! У меня есть гениальная бизнес-идея. Но если вы хотите что-то попроще? То вот, - с этими словами " \
                "она показала на вход. За стеклянными дверями стояла роскошная машина. Это Феррари новенькой модели, " \
                "которая по цвету была, как и волосы незнакомки – ярко оранжевой. А за рулем сидел ваш покорный " \
                "слуга, Никки. Это была наша первая встреча. \nА машина предназначалась в подарок. О чем говорил " \
                "красивый бант сбоку и надпись: «дорогому крестнику!»"

you_want_me_text = "Вы невольно ахнули. Но что-то здесь не так. Ведь бесплатный Феррари бывает… вообще такого не " \
                   "бывает. \n\nОна продолжала:\n- Видите ли, у меня свой сельскохозяйственный бизнес. Но последнее " \
                   "время дела идут из рук вон плохо. Я всю жизнь выращиваю тыквы. Раньше еще можно было как-то жить " \
                   "за счет этого. То джин обратиться ко мне – его клиент загадал машину. То колдунья придет за " \
                   "тыквой. А иногда и сам!.. люди готовы продать душу за кусок железа."

dont_understand = "Все просто! Мои тыквы волшебные. В полночь, если произнести заклинание, они превращаются в " \
                  "спорткар. Да, да, а раньше превращались в карету. \n\nДжессика поправила волосы. Она явно была " \
                  "довольна произведенным эффектом. Ведь у вас от удивления открылся рот. \n\n- Но вот беда, " \
                  "никто не хочет их покупать! Ума не приложу, что не так? Я думаю нужна современная реклама в " \
                  "интернете. На джинов и колдуний надежды уже совсем нет."

pumpkins_these = "С серьезным лицом девушка достала из сумки небольшую оранжевую тыкву. \nВ этот момент вы решили, " \
                 "что вас разыгрывают. И принялись осматриваться по сторонам. Но в холле никого не было. \n\nВы 5 " \
                 "минут тупо смотрите на тыкву перед вами. Обычная небольшая, довольно плотная. Наверное из таких " \
                 "тыкв получаются отличные украшения на хэлоуин, а может быть и неплохая тыквенная каша. Но Феррари! " \
                 "Вы снова смотрите на улицу. \n\nЯ поправляю бантик на спорткаре и приветливо машу вам через стекло " \
                 "деверей."

ordinary_pumpkin_text = "Именно так все и думают! И вместе мы должны это исправить 😊\n\nПроблема в том, что тыквы " \
                        "выглядят невзрачно. Волшебная тыква на вкус такая же как обычная. Но знали бы люди, " \
                        "как сложно вырастить одну такую тыкву! \n\nНам нужно сделать так, чтобы тыквы стали " \
                        "привлекать покупателей! Нужно продемонстрировать весь их потенциал! Ведь это же настоящее " \
                        "100% волшебство! Я и сертификат даю. Но что толку – на словах никто не верит. Нужно показать " \
                        "людям, иначе они не поверят. \n\nВы невольно бросаете взгляд на улицу. Феррари все еще там."

how_do_this_text = "Для этого я оставлю с вами Никкиа. Это робот-учитель. Он посвятит вас в тайны дизайнерской " \
                   "алхимии. После чего вы сможете овладеть тайным знанием и разработать макеты рекламы волшебных " \
                   "тыкв для интернета. \n\nПросто найдите лучший вариант для визуальной рекламы, чтобы мы могли " \
                   "начать покорять интернет. И я обещаю, что отдам вам весь бизнес целиком, за процент от продаж. " \
                   "Тогда я смогу полностью посвятить себя своему огороду и путешествиям. \n\nС этими словами дама " \
                   "мечтательно уставилась в потолок, вспоминая о далеких тыквенных полях Прованса. Потом она вдруг " \
                   "засмеялась, сделала шаг назад и растворилась в свете. \n\n- кто это? – голос администратора вывел " \
                   "вас из забытья. \n- Это моя дальняя родственница. \n\nВы вышли на улицу, пытаясь найти " \
                   "таинственную гостью, и тут же наткнулись на меня. \n\n- Скажите, вы готовы начать обучение? 💪"

chapter_1 = "***\nГЛАВА 1. ДИЗАЙН – ЭТО СОВРЕМЕННАЯ МАГИЯ\m***"

i_ready_text = "Тогда начнем ☺️\n\nЯ расскажу вам о возможностях " \
               "дизайна, с помощью которых вы можете быстро продавать хоть овощи, хоть автомобили. Дизайн – это " \
               "тайное оружие современных магов и маркетологов. Он позволяет наглядно доказать выгоды покупки, " \
               "убедить людей в пользе и необходимости товара. То, что не удается сделать страницам текстов и часам " \
               "уговоров, можно за секунды осуществить с помощью профессионального дизайна. Такова сила воздействия " \
               "этого орудия.  \nБез него нам не справиться."

car_text = "Вы получите ее сразу после прохождения обучения. \nЧто ж, это похоже на сон. Но робот стоит перед вами и " \
           "ждет вашего решения."

good_i_ready_text = "Нас окружает дизайн: баннеры на улицах, упаковка продукта в супермаркете, рекламный ролик на " \
                    "ютубе, захватывающий шутер или аркада на телефоне. Над все этим работают моушн-, саунд-, гейм-, " \
                    "продакт-, ландшафтные, промышленные, графические дизайнеры и иллюстраторы. Дизайнеры эмоции и " \
                    "идеи превращают в визуально-понятные для пользователя образы, при этом думаю не только об " \
                    "эстетике, но и о функциональности.\nМногие из сфер дизайна объединяет в себе графический дизайн."

graphic_design_text = "Графический дизайнер — универсальный специалист. Умеет работать как с печатной продукцией, " \
                      "так и в сфере digital.\nОн создает фирменный стиль и весь визуальный контент для брендов: " \
                      "баннеры и плакаты, упаковку, логотип и фирменный стиль, дизайн соцсетей и макеты сайта."

our_goal_text = "В курсе мы раскроем темы, которые можно применить как в онлайн, так и в офлайн-мире. Но акцент " \
                "все-таки сделаем на цифровой среде и более узкой профессии *диджитал-дизайнера.*"

link_photo_1 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/7464830f-70d8-48b8-9d10-0f7c0ff96724"

digital_design_text = "Еще используют другое название профессии — это UI/UX-дизайнер. UI — User Interface (" \
                      "пользовательский интерфейс), UX — User Experience ( пользовательский опыт)."

digital_design_2_text = "Звучит сложно? Ну ничего, дальше будет проще! \nА теперь самое интересно! Кому это все нужно?"

who_needs_all_this_text = "Диджитал-дизайнеры востребованы в крупных компаниях (на текущий момент больше 3000 " \
                          "вакансий на работных сайтах), в дизайн-агентствах и агентствах полного цикла. Зарплата " \
                          "начинающего специалиста от 60 000 рублей.\n\nМногие компании нанимают специалистов под " \
                          "конкретные проекты, не в штат, и готовы платить за это деньги, поэтому фриланс в " \
                          "диджитал-дизайне тоже распространен. Как правило, фрилансер работает удаленно и может " \
                          "зарабатывать до 200 000 рублей в месяц, если нашел заказчика (или заказчик нашел его)."

text_2 = "Неплохо, правда? И все это благодаря навыкам дизайна!"

text_3 = "*Необходимые навыки диджитал-дизайнера:*        \n— базовые знания в графический дизайне (композиция, типографика, цвет, креативное и системное мышление)       \n— понимание трендов визуального искусства, «насмотренность», стремление развиваться       \n— командная работа, понимание специфики каждого специалиста (в том числе разработки и маркетинга)     \n— управление временем     \n— умение защитить проект перед заказчику или менеджером внутри команды"

text_4 = "Вот их то мы и будем изучать, чтобы создать упаковку нашего тыквенного стартапа."

text_5 = "Хороший вопрос. Для работы нужно овладеть конкретными инструментами."

text_6 = "*Основные инструменты диджитал-дизайнера:*\n\nFigma – самая актуальный и востребованный онлайн-редактор. Можно пользоваться как в браузере, так и скачать приложение на компьютер с figma.com\n\nПакет Adobe (Photoshop, Illustrator, After Effects) – самые популярные программы для работы с растровой и векторной графикой, создания анимации. Пробную версию на 30 дней можно скачать с официального сайта creativecloud.com\n\nБлокнот, Miro, Гугл-документы, Keynote — дополнительные инструменты, которые могут создавать mindmap, создавать прототипы, презентовать свою работу заказчику."

text_7 = "Именно здесь творится вся магия. Но чтобы ее освоить, нужно для начала вооружиться знаниями. "

text_8 = "У меня на курсе и в книгах, конечно! "

text_9 = "Больше погрузиться в профессию поможет литература"

link_photo_2 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/496a35b6-4204-4d74-87e9-037c1d88424c"

link_photo_3 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/be550b7e-f53a-4b52-9cd2-847c8bd5d0f4"

link_photo_4 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/be550b7e-f53a-4b52-9cd2-847c8bd5d0f4"

text_10 = "В начале всегда сложно запомнить новое! Но, не беспокойтесь об этом, вы быстро всему научитесь. И сможете играючи рекламировать не только тыквы, но и все, что пожелаете. \nНо для этого важно, чтобы вы не только запоминали информацию, но и понимали, о чем я говорю. Поэтому, в конце каждого раздела я буду задавать вам некоторые вопросы для закрепления полученных знаний. \n\nВы готовы пройти небольшой тест? "

text_11 = "В чем отличия графического и диджитал-дизайнера\n\n1) Это разные название одного и того же, различий нет\n2) Графический дизайнер охватывает множество направлений в дизайне как цифровых, так и аналоговых носителей. Диджитал- дизайнер направлен только на проектирование в онлайн-пространстве\n3) Графический дизайнер работает с графикой — иллюстрации, постеры, рекламные баннеры и тд. Диджитал-дизайнер все это переводит в цифровой формат."

text_12 = "✅ Это правильный ответ \nНо следует уточнить, что у этих понятий много общего."

text_13 = "Диджитал дизайнер изначально ориентирован на цифровой дизайн и цифровые носители. "

text_14 = "Что такое UI и UX?\n\n1) UI и UX – дополнительная приставка в портфолио дизайнера, чтобы создать впечатление профессионализма\n2) UI — User Interface (пользовательский интерфейс), UX — User Experience ( пользовательский опыт).\n3) UI и UX — дизайнер, который занимается отрисовкой интерфейсов"

text_15 = "✅ Это правильный ответ. Ориентированность на пользователя играет важную роль в современном дизайне. "

text_16 = "Не верно. UI и UX – это целая система знаний, которые постоянно используются в работе. "

text_17 = "👍 Отлично. вы прошли тест и усвоили полученную информацию. Готовы перейти к следующей главе? "

text_18 = "*ГЛАВА 2. НАСМОТРЕННОСТЬ И ВДОХНОВЕНИЕ*"

text_19 = "Для того, чтобы сформировать вкус, накапливать базу дизайнерских решений и отслеживать тренды важно видеть много примеров работ. Это позволяет тренировать насмотренность — умение наблюдать, фиксировать плюсы и минусы в работах любых направлений и в окружающем мире."

text_20 = "Есть один простой совет. "

text_21 = "Сформируйте привычку — по утрам посещайте дизайнерские ресурсы, пополняйте свои коллекции и уже через несколько месяцев вы сформируете свое видение практически на любую дизайн-задачу."

text_22 = "*Ресурсы для вдохновения:*\n\nBehance.net – самый популярный дизайн-ресурсы, где профессионалы со всего мира формируют свои портфолио. Многие заказчики находят исполнителей именно здесь, просматривая работы, которые завоевали награды и находятся в подборках.\nТакже на этом сайте многие пользователи собирают коллекции и делятся ими с любым желающим, вот пример:\nhttps://www.behance.net/collection/17282653/UIUX \nhttps://www.behance.net/collection/72317/WEB-Design \nDribbble.com – здесь выкладываются «шоты» - небольшие зарисовки, концепты, иллюстрации и анимация. Подходит, когда надо быстро посмотреть возможные решения или вдохновиться необычными концептами.\nmadeontilda.ru - галерея отобранных экспертами Tilda лучших работ, которые собраны на конструкторы и являются примерами современного веб-дизайна. \npinterest.com – коллекция изображений из любой сферы по направлениям, которая пополняется любым пользователем сети. Можно создавать свои «доски» и добавлять любую из понравившихся работ."

text_23 = "А эта подборки лучших сайтов со всего мира, большинство из них взяли награды:\nsiteinspire.com \nland-book.com \nawwwards.com \n"

text_24 = "Но мало просто зайти на сайт, чтобы смотреть картинки. С ними нужно работать!"

text_25 = "Любую понравившуюся работу лучше проанализировать, задавая себе вопросы:\nЧто именно мне нравится?\nМожет быть какая-то конкретная деталь? или цвета, шрифты , композиция? \nЧто смущает и что можно бы было сделать лучше?\nЧто можно было бы поменять, чтобы работа стала нравится полностью\nКак дизайнер пришел к такому решению?\nКакую подготовительную работу провел дизайнер, чтобы получился именно этот вариант? Почему он выбрал именно такое расположение элементов, шрифт или слова? Какая может быть ЦА?\n\nНо это еще не все! Есть еще как минимум два инструмента, чтобы прокачаться с помощью чужих работ."

text_26 = "*Повторить за автором*\nДля того, чтобы перебороть страх «белого листа» можно начать с копирования лучших дизайнов: полностью перенести готовую работу в графический редактор, слой за слоем. Это поможет понять, чем руководствовался создатель при выборе решения, какими инструментами он пользовался."

text_27 = "*Референсы и мудборды*\nЭти инструменты помогают подступиться к любой из задач.\n\nРеференсы (от англ reference – рекомендация, справка) — это картинка для вдохновения, которая задает направление для будущего дизайна.\n\nМудборд (от англ. mood board — доска настроения) — это коллаж, собранный из фотографий, иллюстраций, текстур, иконок, цветовых схем и шрифтов, то есть из множества референсов.  Мудборд необходим для понимания будущего дизайн-проекта: каким он будет — веселым и игривым или серьезным и прагматичным, какие могут быть шрифты и сочетание цветов, какие визуальные образы подходят для задачи."

link_photo_5 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/93fbc057-e5af-4121-a660-2479f497e92f"

text_28 = "Ну что? Вдохновляет? Вижу, как у вас горят глаза и не терпится попробовать самому! \nИ пробуйте! А пока у меня есть еще кое-что интересное для вас! "

text_29 = "Почти. Это Дополнительные материалы по теме. Очень советую ознакомиться"

text_30 = "Youtube \nTilda Publishing Russia\nhttps://www.youtube.com/watch?v=aKuuXFYPYac"

link_photo_6 = "https://s3-eu-west-1.amazonaws.com/flowxo-images/images/52a84b82-457c-4ac8-ab07-082dfc4b5a93"

text_31 = "Кради как художник. 10 уроков творческого самовыражения Остин Клеон"

text_32 = "Надеюсь здесь было все понятно? "

text_ = ""

text_ = ""

text_ = ""

text_ = ""


text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""


text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""


text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""


text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""

text_ = ""


